; domain
(define (domain blocksworld)
  (:requirements :strips :typing)
  (:types block hand - object
          stickyh slippery - hand)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty ?h - hand)
	       (holding ?h - hand ?x - block)
               (movable ?x - block)
               (sticky ?x - block)
	       )

  (:action pick-up-sl
	     :parameters (?x - block ?h - slippery)
	     :precondition (and (clear ?x) (ontable ?x) (handempty ?h)(movable ?x))
	     :effect
	     (and  
                   (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty ?h))
		   (holding ?h ?x)))

  (:action pick-up-st
	     :parameters (?x - block ?h - stickyh)
	     :precondition (and (clear ?x) (ontable ?x) (handempty ?h)(movable ?x))
	     :effect
	     (and  
                   (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty ?h))
		   (holding ?h ?x)
                   (sticky ?x)
                      ))

  (:action put-down
	     :parameters (?x - block ?h - hand)
	     :precondition (and (holding ?h ?x))
	     :effect
	     (and (not (holding ?h ?x))
		   (clear ?x)
		   (handempty ?h)
		   (ontable ?x)))

  (:action stack
	     :parameters (?x - block ?y - block ?h - hand)
	     :precondition (and (holding ?h ?x) (clear ?y))
	     :effect
	     (and (not (holding ?h ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty ?h)
		   (on ?x ?y)))

  (:action unstack-sl
	     :parameters (?x - block ?y - block ?h - slippery)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty ?h)(movable ?x))
	     :effect
	     (and  
                   (holding ?h ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty ?h))
		   (not (on ?x ?y))))

  (:action unstack-st
	     :parameters (?x - block ?y - block ?h - stickyh)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty ?h)(movable ?x))
	     :effect
	     (and  
                   (holding ?h ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty ?h))
		   (not (on ?x ?y))
                   (sticky ?x)))


)

; problem
(define (problem BW-rand-10)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10  - block
   h1 - slippery
          h2 - stickyh)
(:init
(handempty h1)
(handempty h2)
(on b1 b4)
(on b2 b7)
(on b3 b5)
(ontable b4)
(on b5 b10)
(on b6 b2)
(ontable b7)
(on b8 b9)
(on b9 b3)
(on b10 b6)
(clear b1)
(clear b8)
(movable b1)
(movable b2)
(movable b3)
(movable b4)
(movable b5)
(movable b6)
(movable b7)
(movable b8)
(movable b9)
(movable b10)
)
(:goal
(and
(on b1 b2)
(on b2 b7)
(on b3 b5)
(on b4 b10)
(on b5 b6)
(on b6 b4)
(on b8 b3)
(on b9 b1))
)
)

; plan
1. (unstack-st b1 b4 h2)
   deleted: (clear b1) (handempty h2) (on b1 b4)
   added: (holding h2 b1) (clear b4) (sticky b1)
   goals met: 2 of 8
2. (unstack-sl b8 b9 h1)
   deleted: (clear b8) (handempty h1) (on b8 b9)
   added: (holding h1 b8) (clear b9)
   goals met: 2 of 8
3. (put-down b1 h2)
   deleted: (holding h2 b1)
   added: (clear b1) (handempty h2) (ontable b1)
   goals met: 2 of 8
4. (unstack-st b9 b3 h2)
   deleted: (clear b9) (handempty h2) (on b9 b3)
   added: (holding h2 b9) (clear b3) (sticky b9)
   goals met: 2 of 8
5. (stack b9 b1 h2)
   deleted: (holding h2 b9) (clear b1)
   added: (clear b9) (handempty h2) (on b9 b1)
   goals met: 3 of 8
6. (stack b8 b3 h1)
   deleted: (holding h1 b8) (clear b3)
   added: (clear b8) (handempty h1) (on b8 b3)
   goals met: 4 of 8
7. (pick-up-sl b4 h1)
   deleted: (ontable b4) (clear b4) (handempty h1)
   added: (holding h1 b4)
   goals met: 4 of 8
8. (unstack-st b8 b3 h2)
   deleted: (clear b8) (handempty h2) (on b8 b3)
   added: (holding h2 b8) (clear b3) (sticky b8)
   goals met: 3 of 8
9. (put-down b4 h1)
   deleted: (holding h1 b4)
   added: (clear b4) (handempty h1) (ontable b4)
   goals met: 3 of 8
10. (unstack-sl b3 b5 h1)
   deleted: (clear b3) (handempty h1) (on b3 b5)
   added: (holding h1 b3) (clear b5)
   goals met: 2 of 8
11. (put-down b3 h1)
   deleted: (holding h1 b3)
   added: (clear b3) (handempty h1) (ontable b3)
   goals met: 2 of 8
12. (stack b8 b3 h2)
   deleted: (holding h2 b8) (clear b3)
   added: (clear b8) (handempty h2) (on b8 b3)
   goals met: 3 of 8
13. (unstack-st b5 b10 h2)
   deleted: (clear b5) (handempty h2) (on b5 b10)
   added: (holding h2 b5) (clear b10) (sticky b5)
   goals met: 3 of 8
14. (unstack-sl b10 b6 h1)
   deleted: (clear b10) (handempty h1) (on b10 b6)
   added: (holding h1 b10) (clear b6)
   goals met: 3 of 8
15. (put-down b10 h1)
   deleted: (holding h1 b10)
   added: (clear b10) (handempty h1) (ontable b10)
   goals met: 3 of 8
16. (unstack-sl b6 b2 h1)
   deleted: (clear b6) (handempty h1) (on b6 b2)
   added: (holding h1 b6) (clear b2)
   goals met: 3 of 8
17. (stack b6 b4 h1)
   deleted: (holding h1 b6) (clear b4)
   added: (clear b6) (handempty h1) (on b6 b4)
   goals met: 4 of 8
18. (stack b5 b6 h2)
   deleted: (holding h2 b5) (clear b6)
   added: (clear b5) (handempty h2) (on b5 b6)
   goals met: 5 of 8
19. (unstack-sl b9 b1 h1)
   deleted: (clear b9) (handempty h1) (on b9 b1)
   added: (holding h1 b9) (clear b1)
   goals met: 4 of 8
20. (put-down b9 h1)
   deleted: (holding h1 b9)
   added: (clear b9) (handempty h1) (ontable b9)
   goals met: 4 of 8
21. (pick-up-sl b1 h1)
   deleted: (ontable b1) (clear b1) (handempty h1)
   added: (holding h1 b1)
   goals met: 4 of 8
22. (stack b1 b2 h1)
   deleted: (holding h1 b1) (clear b2)
   added: (clear b1) (handempty h1) (on b1 b2)
   goals met: 5 of 8
23. (pick-up-sl b9 h1)
   deleted: (ontable b9) (clear b9) (handempty h1)
   added: (holding h1 b9)
   goals met: 5 of 8
24. (stack b9 b1 h1)
   deleted: (holding h1 b9) (clear b1)
   added: (clear b9) (handempty h1) (on b9 b1)
   goals met: 6 of 8
25. (unstack-sl b5 b6 h1)
   deleted: (clear b5) (handempty h1) (on b5 b6)
   added: (holding h1 b5) (clear b6)
   goals met: 5 of 8
26. (unstack-st b8 b3 h2)
   deleted: (clear b8) (handempty h2) (on b8 b3)
   added: (holding h2 b8) (clear b3)
   goals met: 4 of 8
27. (put-down b5 h1)
   deleted: (holding h1 b5)
   added: (clear b5) (handempty h1) (ontable b5)
   goals met: 4 of 8
28. (pick-up-sl b3 h1)
   deleted: (ontable b3) (clear b3) (handempty h1)
   added: (holding h1 b3)
   goals met: 4 of 8
29. (stack b3 b5 h1)
   deleted: (holding h1 b3) (clear b5)
   added: (clear b3) (handempty h1) (on b3 b5)
   goals met: 5 of 8
30. (stack b8 b3 h2)
   deleted: (holding h2 b8) (clear b3)
   added: (clear b8) (handempty h2) (on b8 b3)
   goals met: 6 of 8
31. (unstack-sl b6 b4 h1)
   deleted: (clear b6) (handempty h1) (on b6 b4)
   added: (holding h1 b6) (clear b4)
   goals met: 5 of 8
32. (put-down b6 h1)
   deleted: (holding h1 b6)
   added: (clear b6) (handempty h1) (ontable b6)
   goals met: 5 of 8
33. (pick-up-sl b4 h1)
   deleted: (ontable b4) (clear b4) (handempty h1)
   added: (holding h1 b4)
   goals met: 5 of 8
34. (stack b4 b10 h1)
   deleted: (holding h1 b4) (clear b10)
   added: (clear b4) (handempty h1) (on b4 b10)
   goals met: 6 of 8
35. (pick-up-sl b6 h1)
   deleted: (ontable b6) (clear b6) (handempty h1)
   added: (holding h1 b6)
   goals met: 6 of 8
36. (unstack-st b8 b3 h2)
   deleted: (clear b8) (handempty h2) (on b8 b3)
   added: (holding h2 b8) (clear b3)
   goals met: 5 of 8
37. (stack b6 b4 h1)
   deleted: (holding h1 b6) (clear b4)
   added: (clear b6) (handempty h1) (on b6 b4)
   goals met: 6 of 8
38. (unstack-sl b3 b5 h1)
   deleted: (clear b3) (handempty h1) (on b3 b5)
   added: (holding h1 b3) (clear b5)
   goals met: 5 of 8
39. (put-down b3 h1)
   deleted: (holding h1 b3)
   added: (clear b3) (handempty h1) (ontable b3)
   goals met: 5 of 8
40. (stack b8 b3 h2)
   deleted: (holding h2 b8) (clear b3)
   added: (clear b8) (handempty h2) (on b8 b3)
   goals met: 6 of 8
41. (pick-up-sl b5 h1)
   deleted: (ontable b5) (clear b5) (handempty h1)
   added: (holding h1 b5)
   goals met: 6 of 8
42. (stack b5 b6 h1)
   deleted: (holding h1 b5) (clear b6)
   added: (clear b5) (handempty h1) (on b5 b6)
   goals met: 7 of 8
43. (unstack-sl b8 b3 h1)
   deleted: (clear b8) (handempty h1) (on b8 b3)
   added: (holding h1 b8) (clear b3)
   goals met: 6 of 8
44. (put-down b8 h1)
   deleted: (holding h1 b8)
   added: (clear b8) (handempty h1) (ontable b8)
   goals met: 6 of 8
45. (pick-up-sl b3 h1)
   deleted: (ontable b3) (clear b3) (handempty h1)
   added: (holding h1 b3)
   goals met: 6 of 8
46. (stack b3 b5 h1)
   deleted: (holding h1 b3) (clear b5)
   added: (clear b3) (handempty h1) (on b3 b5)
   goals met: 7 of 8
47. (pick-up-sl b8 h1)
   deleted: (ontable b8) (clear b8) (handempty h1)
   added: (holding h1 b8)
   goals met: 7 of 8
48. (stack b8 b3 h1)
   deleted: (holding h1 b8) (clear b3)
   added: (clear b8) (handempty h1) (on b8 b3)
   goals met: 8 of 8
